In [1]:
import pandas as pd

In [2]:
payments = pd.read_csv("old/sidooh_payments.csv")
vouchers = pd.read_csv("old/sidooh_vouchers.csv")

In [3]:
payments_new = payments.copy()
vouchers_new = vouchers.copy()

In [4]:
payments_new

,id,payable_id,payable_type,amount,status,type,subtype,payment_id,start_date,created_at,updated_at
0,1,1,App\Models\Transaction,20,Complete,MPESA,STK,1,2021-02-01 16:38:25,2021-02-01 17:10:23,2021-02-01 17:13:57
1,2,2,App\Models\Transaction,50,Complete,MPESA,STK,2,2021-02-01 16:38:25,2021-02-01 17:11:04,2021-02-01 17:11:47
2,3,3,App\Models\Transaction,475,Complete,SIDOOH,VOUCHER,1,2021-02-01 16:38:25,2021-02-01 17:17:15,2021-02-01 17:17:15
3,4,4,App\Models\Transaction,8775,Failed,MPESA,STK,3,2021-02-01 16:38:25,2021-02-01 17:20:44,2021-02-01 17:20:44
4,5,5,App\Models\Transaction,20,Failed,MPESA,STK,4,2021-02-01 16:38:25,2021-02-01 17:22:49,2021-02-01 17:22:49
...,...,...,...,...,...,...,...,...,...,...,...
12985,12986,12993,App\Models\Transaction,100,Complete,MPESA,STK,12183,2021-02-01 16:38:25,2022-07-21 18:26:49,2022-07-21 18:27:01
12986,12987,12994,App\Models\Transaction,50,Complete,MPESA,STK,12184,2021-02-01 16:38:25,2022-07-21 18:51:13,2022-07-21 18:51:24
12987,12988,12995,App\Models\Transaction,50,Failed,MPESA,STK,12185,2021-02-01 16:38:25,2022-07-21 18:53:08,2022-07-21 18:53:19
12988,12989,12996,App\Models\Transaction,80,Complete,MPESA,STK,12186,2021-02-01 16:38:25,2022-07-21 18:55:05,2022-07-21 18:55:19
12989,12990,12997,App\Models\Transaction,50,Complete,MPESA,STK,12187,2021-02-01 16:38:25,2022-07-21 18:58:10,2022-07-21 18:58:27

In [5]:
payments_new['description'] = ''
payments_new['reference'] = ''
del payments_new['payable_id']
del payments_new['payable_type']
del payments_new['start_date']

def statusTransform(val):
    val = val.upper()
    
    if (val in ['COMPLETE', 'PAID']):
        val = 'COMPLETED'
        
    if (val == 'CANCELLED'):
        val = 'FAILED'
    
    return val


payments_new['status'] = payments['status'].apply(statusTransform)

In [6]:
payments_new

,id,amount,status,type,subtype,payment_id,created_at,updated_at,description,reference
0,1,20,COMPLETED,MPESA,STK,1,2021-02-01 17:10:23,2021-02-01 17:13:57,,
1,2,50,COMPLETED,MPESA,STK,2,2021-02-01 17:11:04,2021-02-01 17:11:47,,
2,3,475,COMPLETED,SIDOOH,VOUCHER,1,2021-02-01 17:17:15,2021-02-01 17:17:15,,
3,4,8775,FAILED,MPESA,STK,3,2021-02-01 17:20:44,2021-02-01 17:20:44,,
4,5,20,FAILED,MPESA,STK,4,2021-02-01 17:22:49,2021-02-01 17:22:49,,
...,...,...,...,...,...,...,...,...,...,...
12985,12986,100,COMPLETED,MPESA,STK,12183,2022-07-21 18:26:49,2022-07-21 18:27:01,,
12986,12987,50,COMPLETED,MPESA,STK,12184,2022-07-21 18:51:13,2022-07-21 18:51:24,,
12987,12988,50,FAILED,MPESA,STK,12185,2022-07-21 18:53:08,2022-07-21 18:53:19,,
12988,12989,80,COMPLETED,MPESA,STK,12186,2022-07-21 18:55:05,2022-07-21 18:55:19,,
12989,12990,50,COMPLETED,MPESA,STK,12187,2022-07-21 18:58:10,2022-07-21 18:58:27,,

In [7]:
vouchers_new

      id      in     out           created_at           updated_at  account_id
0      1  3161.0  2110.0  2021-02-01 17:10:23  2022-06-23 06:32:15           1
1      2   820.0   820.0  2021-02-01 17:11:04  2022-06-07 17:42:14           2
2      3     0.0     0.0  2021-02-01 17:22:49  2021-02-01 17:22:49           3
3      4  1144.0  1144.0  2021-02-01 18:17:12  2022-05-06 09:37:37           4
4      5   100.0   100.0  2021-02-01 18:35:16  2021-03-31 14:43:09           5
..   ...     ...     ...                  ...                  ...         ...
819  820     0.0     0.0  2022-07-04 04:15:12  2022-07-04 04:15:12         820
820  821     0.0     0.0  2022-07-05 04:06:40  2022-07-05 04:06:40         821
821  822     0.0     0.0  2022-07-07 18:07:34  2022-07-07 18:07:34         822
822  823     0.0     0.0  2022-07-09 17:58:05  2022-07-09 17:58:05         823
823  824     0.0     0.0  2022-07-18 14:21:42  2022-07-18 14:21:42         824

[824 rows x 6 columns]

In [8]:
vouchers_new['type'] = 'SIDOOH'
vouchers_new['balance'] = vouchers_new['in'] - vouchers_new['out']

In [9]:
vouchers_new

,id,in,out,created_at,updated_at,account_id,type,balance
0,1,3161.0,2110.0,2021-02-01 17:10:23,2022-06-23 06:32:15,1,SIDOOH,1051.0
1,2,820.0,820.0,2021-02-01 17:11:04,2022-06-07 17:42:14,2,SIDOOH,0.0
2,3,0.0,0.0,2021-02-01 17:22:49,2021-02-01 17:22:49,3,SIDOOH,0.0
3,4,1144.0,1144.0,2021-02-01 18:17:12,2022-05-06 09:37:37,4,SIDOOH,0.0
4,5,100.0,100.0,2021-02-01 18:35:16,2021-03-31 14:43:09,5,SIDOOH,0.0
...,...,...,...,...,...,...,...,...
819,820,0.0,0.0,2022-07-04 04:15:12,2022-07-04 04:15:12,820,SIDOOH,0.0
820,821,0.0,0.0,2022-07-05 04:06:40,2022-07-05 04:06:40,821,SIDOOH,0.0
821,822,0.0,0.0,2022-07-07 18:07:34,2022-07-07 18:07:34,822,SIDOOH,0.0
822,823,0.0,0.0,2022-07-09 17:58:05,2022-07-09 17:58:05,823,SIDOOH,0.0
823,824,0.0,0.0,2022-07-18 14:21:42,2022-07-18 14:21:42,824,SIDOOH,0.0

In [10]:
voucher_trans = vouchers_new.copy()
voucher_trans[['created_at', 'updated_at']] = pd.to_datetime('now')
voucher_transactions_in['voucher_id'] = voucher_transactions_in['id']

del voucher_trans['balance']
del voucher_trans['account_id']

voucher_transactions_in = voucher_trans.copy()

voucher_transactions_in['type'] = 'CREDIT'
voucher_transactions_in['amount'] = voucher_transactions_in['in']
voucher_transactions_in['description'] = "Credits B/F"

del voucher_transactions_in['id']
del voucher_transactions_in['in']
del voucher_transactions_in['out']


voucher_transactions_out = voucher_trans.copy()
voucher_transactions_out['type'] = 'DEBIT'
voucher_transactions_out['amount'] = voucher_transactions_out['out']
voucher_transactions_out['description'] = "Debits B/F"

del voucher_transactions_out['id']
del voucher_transactions_out['in']
del voucher_transactions_out['out']

In [11]:
voucher_transactions_in

,created_at,updated_at,type,amount,description,voucher_id
0,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,3161.0,Credits B/F,1
1,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,820.0,Credits B/F,2
2,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,3
3,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,1144.0,Credits B/F,4
4,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,100.0,Credits B/F,5
...,...,...,...,...,...,...
819,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,820
820,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,821
821,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,822
822,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,823
823,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,824

In [12]:
voucher_transactions_out

,created_at,updated_at,type,amount,description,voucher_id
0,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,2110.0,Debits B/F,1
1,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,820.0,Debits B/F,2
2,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,0.0,Debits B/F,3
3,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,1144.0,Debits B/F,4
4,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,100.0,Debits B/F,5
...,...,...,...,...,...,...
819,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,0.0,Debits B/F,820
820,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,0.0,Debits B/F,821
821,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,0.0,Debits B/F,822
822,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,0.0,Debits B/F,823
823,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,0.0,Debits B/F,824

In [13]:
voucher_transactions = pd.concat([voucher_transactions_in, voucher_transactions_out]).sort_values('voucher_id')
voucher_transactions

,created_at,updated_at,type,amount,description,voucher_id
0,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,3161.0,Credits B/F,1
0,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,2110.0,Debits B/F,1
1,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,820.0,Credits B/F,2
1,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,820.0,Debits B/F,2
2,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,3
...,...,...,...,...,...,...
821,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,822
822,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,0.0,Debits B/F,823
822,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,823
823,2022-07-21 23:29:52.103968,2022-07-21 23:29:52.103968,CREDIT,0.0,Credits B/F,824
823,2022-07-21 23:29:52.073553,2022-07-21 23:29:52.073553,DEBIT,0.0,Debits B/F,824

In [14]:
del vouchers_new['in']
del vouchers_new['out']

In [15]:
payments_new.to_csv('new/payments/sidooh_payments.csv', index = False)

vouchers_new.to_csv('new/payments/sidooh_vouchers.csv', index = False)
voucher_transactions.to_csv('new/payments/sidooh_voucher_transactions.csv', index = False)